<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of JDDD and imports it into Munki.</string>
	<key>Identifier</key>
	<string>de.desy.it.mac.munki.JDDD</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>JDDD</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>minimum_os_version</key>
			<string>10.11</string>
			<key>developer</key>
			<string>DESY MCS4</string>
			<key>display_name</key>
			<string>JDDD</string>
			<key>icon_name</key>
			<string>JDDD.png</string>
			<key>category</key>
			<string>Developer Tools</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>blocking_applications</key>
			<array>
				<string>jddd</string>
			</array>
			<key>unattended_install</key>
			<true/>
			<key>description</key>
			<string>&lt;i&gt;This item installs JDDD - a program to draw and run control system panels.&lt;/i&gt;&lt;br&gt;
&lt;br&gt;
&lt;strong&gt;Description&lt;/strong&gt;&lt;br&gt;
The Java DOOCS Data Display (JDDD) is a program to draw control system panels with an editor and to run the created drawings with real data.&lt;br&gt;
Provided with the most current OpenJDK version no additional Java installation is required.&lt;br&gt;
Two versions of the program are available. One is the jdddEditor to draw and test the drawings. The second one is a run-time version only, which does not allow to change a drawing.&lt;br&gt;
The jdddEditor offers reusable Java components like labels, buttons, plots, etc. to draw control system panels. The panel structure is stored in xml-format either to a local file system or to a subversion repository.&lt;br&gt;
&lt;br&gt;
&lt;strong&gt;Please note&lt;/strong&gt;
&lt;ul&gt;
	&lt;li&gt;Please report bugs to: &lt;a href="mailto:jddd@desy.de?subject=JDDD bugs&amp;"&gt;jddd@desy.de&lt;/a&gt;&lt;/li&gt;
&lt;/ul&gt;
&lt;strong&gt;Learn more&lt;/strong&gt;
&lt;ul&gt;
	&lt;li&gt;&lt;a href="https://ttfinfo.desy.de/elog/XMLlist?file=/DOOCS-public/data/jddd&amp;xsl=/elogbook/xsl/wiki.xsl&amp;picture=true" target="_blank" rel="noopener"&gt;JDDD Documentation&lt;/a&gt;&lt;/li&gt;
	&lt;li&gt;&lt;a href="https://ttfinfo.desy.de/DOOCSWiki/Wiki.jsp?page=JDDDTraining" target="_blank" rel="noopener"&gt;JDDD Training&lt;/a&gt;&lt;/li&gt;
	&lt;li&gt;&lt;a href="https://ttfinfo.desy.de/DOOCSWiki/Wiki.jsp?page=DOOCS%20Wiki" target="_blank" rel="noopener"&gt;DOOCS Wiki&lt;/a&gt;&lt;/li&gt;
&lt;/ul&gt;</string>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>de.desy.it.mac.download.JDDD</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%pathname%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>Unarchiver</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>dmg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
				<key>dmg_root</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
			</dict>
			<key>Processor</key>
			<string>DmgCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%dmg_path%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
